#+TITLE: DM2 Assignment 05.3
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: theme-bigblow.setup

[[elisp:(find-file-other-window%20"generic-instructions.org")][Read Instructions]]
[[elisp:(progn%20(save-buffer)%20(browse-url-of-file%20(org-html-export-to-html)))][Export to HTML and Browse]]
[[elisp:(progn%20(save-buffer)%20(org-clock-report%201)%20(save-buffer))][Insert/Update Clock Summary Report]]
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2018-10-22 Mon 17:12]
| Headline                                    |   Time |      |
|---------------------------------------------+--------+------|
| *Total time*                                | *2:38* |      |
|---------------------------------------------+--------+------|
| Combinatorial Proofs                        |   0:38 |      |
| \_  Validate A Committee with Chair and...  |        | 0:01 |
| \_  Validate Another Identity               |        | 0:37 |
| Basic Probability Theory                    |   2:00 |      |
| \_  Answer a Probability Question           |        | 0:32 |
| \_  Answer Another Probability Question     |        | 0:46 |
| \_  Answer Yet Another Probability Question |        | 0:42 |
#+END:

* Combinatorial Proofs
** DONE Validate A Committee with Chair and Co-Chair Identity
   CLOSED: [2018-10-22 Mon 17:09]
   :LOGBOOK:
   CLOCK: [2018-10-22 Mon 17:09]--[2018-10-22 Mon 17:10] =>  0:01
   :END:
    Give a *combinatorial argument* that if n is a positive integer then

    \(\sum^n_{k = 0} k^2{n \choose k} = n(n + 1)2^{n - 2}.\)

    Hint: show that both sides count the ways to select a subset of a set of n
    elements together with two not necessarily distinct elements from this subset.
    It will be easier to do so if you express the right-hand side of the identity
    as the equivalent n(n - 1)2^{n - 2} + n2^{n - 1} (after verifying that they are
    indeed equivalent).


   1. \Sigma^n_{k=0} k{n \choose k}x^{k-1} = n(1 + x)^{n-1}
      \Rightarrow n2^{n-1} = \Sigma^n_{k=0} k{n \choose k}
   2. \Sigma^n_{k=0} k{k - 1}{n \choose k}x^{k-2} = n{n - 1}{1 + x}^{n-2}
      \Rightarrow \Sigma^n_{k=0} k{k - 1}{n \choose k} = n{n - 1}2^{n-2}

   Add 1 and 2 to get:
    \Sigma^n_{k=0} k^2{n \choose k} = n{n + 1}2^{n-2}

   Help for Solution found from Tyler Elkington.

** DONE Validate Another Identity
   CLOSED: [2018-10-22 Mon 17:11]
   :LOGBOOK:
   CLOCK: [2018-10-22 Mon 10:53]--[2018-10-22 Mon 11:30] =>  0:37
   :END:
    Using a *combinatorial argument*, argue for the validity of the identity

    \({n \choose r}{r \choose k} = {n \choose k}{n - k \choose r - k}\)

    whenever n, r, and k are nonnegative integers with r \le n and k \le r.

:    n!          r!                n!            (n-k)!
: -------- * ----------    =   --------- * ------------------
: (n-r)!r!    (r-k)!k!         (n-k)!k!     (n-(r-k))!(r-k)!
:                            
:                                               
:        n!r!                          (n-k)!n!
: ------------------           ------------------------
:  (n-r)!r!(r-k)!k!            (n-k)!(n-r+k)!(r-k)!k!
:                            
:                                               
:         n!                           n!
: ------------------           ------------------
:   (n-r)!(r-k)!k!              (n-r+k)!(r-k)!k!
:                            

I have tried to see how (n-r)! is equal to (n-r+k)!
I know that they should be equal to each other,
but I do not know how to finish the proof.
    

* Basic Probability Theory
** DONE Answer a Probability Question
   CLOSED: [2018-10-22 Mon 10:12]
   :LOGBOOK:
   CLOCK: [2018-10-22 Mon 09:40]--[2018-10-22 Mon 10:12] =>  0:32
   :END:
    A dark room contains two barrels. The first barrel is filled with green
    marbles, the second is filled with a half-and-half mixture of green and blue
    marbles. So there\rsquo{}s a 100% chance of choosing a green marble from the first
    barrel, and a 50% chance of choosing either color in the second barrel. You
    reach into one of the barrels (it\rsquo{}s dark so you don\rsquo{}t know which one) and
    select a marble at random. It\rsquo{}s green. You select another. It\rsquo{}s green too. You
    select a third, a fourth, a fifth, etc. Green each time. What is the *minimum*
    number of marbles you need to select to *exceed* a probability of 99% that you
    are picking them out of the all-green barrel? (Note that there are enough
    marbles so that the answer does not depend on how many marbles are in the
    second barrel.)

    :HINT:
    These are all independent events, so the probability of choosing n green
    marbles in a row from the half-and-half barrel is (1/2)^n. Compute the
    complementary probability --- that of choosing at least one blue marble ---
    to be 1 - (1/2)^n. That probability first exceeds 99% when n equals what? In
    other words, after how many green marbles in a row are you 99+% sure that
    you are picking marbles out of the all-green barrel?
    :END:

(let ((prob 0)
      (n    1))
    (while (< prob .99)
      (setq prob (- 1 (expt .5 n))
            n    (1+ n))
    )
    (1- n)
)7

(1 - (1/2)^n) = 0.99
(1/2)^n = 0.01
n = log_(1/2)0.01

(log 0.01 .5)6.643856189774724
(- 1 (expt .5 6))0.984375
(- 1 (expt .5 7))0.9921875 

After picking seven green marbles I can be over 99% sure I am picking from the 
barrel of all green marbles.

** DONE Answer Another Probability Question
   CLOSED: [2018-10-22 Mon 15:52]
   :LOGBOOK:
   CLOCK: [2018-10-22 Mon 15:32]--[2018-10-22 Mon 15:42] =>  0:10
   CLOCK: [2018-10-22 Mon 10:12]--[2018-10-22 Mon 10:48] =>  0:36
   :END:
   Take a deep breath. Suppose Shakespeare\rsquo{}s account is accurate and Julius
   Caesar gasped \ldquo{}You too, Brutus\rdquo before breathing his last. What is the
   probability that you just inhaled a molecule that Julius Caesar exhaled in
   his dying breath?

   Assume that after more than two thousand years the exhaled molecules are
   uniformly spread about the world and the vast majority are still free in the
   atmosphere. Assume further that there are 10^{44} molecules of air in the world,
   and that your inhaled quantity and Caesar\rsquo{}s exhaled quantity were each about
   2.2 x 10^{22} molecules.

   :HINT:
   If a number x is small, then (1 - x) is approximately equal to e^{-x}, where e =
   2.718281828 (approximately).


   

#+BEGIN_SRC elisp :results raw
  (exp 1)
#+END_SRC

#+RESULTS:
2.718281828459045
   :END:

(1 - (1 - 2.2*10^22/10^44)^(2.2*10^22))
(1 - (e^(-(2.2*10^22/10^44)))^(2.2*10^22))
(1 - (e^-4.84))
(- 1 (exp -4.84))

0.9920929459484066

There is a 99.2% chance that at least one of of the 
molecules you breathe in will be a molecule of 
Caesar's last breath.

** DONE Answer Yet Another Probability Question
   CLOSED: [2018-10-22 Mon 17:09]
   :LOGBOOK:
   CLOCK: [2018-10-22 Mon 16:30]--[2018-10-22 Mon 17:08] =>  0:38
   CLOCK: [2018-10-22 Mon 10:49]--[2018-10-22 Mon 10:53] =>  0:04
   :END:
   If students Art, Bill, Cathy, and Diane each speak the truth once in three
   times (independently), and Art affirms that Bill denies that Cathy declares
   that Diane is a liar, what is the probability that Diane was speaking the
   truth?

   You may assume that:

  1. All four students made statements.
  2. Art, Bill, and Cathy each made a statement that either affirmed or denied
       the statement that follows.
  3. A lying affirmation is taken to be a denial and a lying denial is taken to
     be an affirmation.

3^4 = 81 possibilities


: Anywhere where this is false \Downarrow
A \equiv [B \equiv \not [C \equiv \not D]]
A \equiv [B \equiv [C \equiv D]]
: \Rightarrow Diane is true

(setq pos '(nil nil t))
(loop for a in pos do
(loop for b in pos do
(loop for c in pos do
(loop for d in pos do
(if (equal a (equal b (not (equal c (not d))))) (print (list a b c d)))
(if (equal a (equal b (equal c d))) (print (list a b c d)))
))))


: After Removing Duplicates the length of the possibilities where What Diane
:  Says is true is 10
(length '(
(nil nil nil nil)

(nil nil t t)

(nil t nil t)

(nil t t nil)

(t nil nil t)

(t nil t nil)

(t nil nil t)

(t nil t nil)

(t t nil nil)

(t t t t)

))10


:CONCLUSION
Diane tells the truth 10 out of 81 times.
(/ 10. 81.0)0.12345679012345678

So, there is a 12.34% chance that Diane is
telling the truth.
:END:
